delight-f/huidu-hd-wf1-port-2026/sdkconfig.defaults.huidu-wf1
# Huidu HD-WF1 (ESP32-S2, 4MB flash, no PSRAM).
# Base: sdkconfig.defaults.pixoticker (closest analogue: same flash, same
# no-PSRAM ESP32 family), retargeted to S2. UNVALIDATED on hardware —
# clock phase, latch blanking, and swap_colors may need bench iteration.
CONFIG_BOARD_HUIDU_WF1=y
CONFIG_BUTTON_PIN=11
CONFIG_BOOT_WEBP_TRONBYT=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_HTTP_BUFFER_SIZE_MAX=60000
CONFIG_HTTP_BUFFER_SIZE_DEFAULT=10000
CONFIG_IDF_TARGET="esp32s2"
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="boards/max_app_4mb.csv"
CONFIG_SPIRAM=n
